IDEA StatiCa Open Model
HangingAroundPatch.NumOfBarsInLayer Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Number of bars in layer
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int NumOfBarsInLayer { get; set; }
Public Property NumOfBarsInLayer As Integer
	Get
	Set
public:
property int NumOfBarsInLayer {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace